"""
Предмет: Теоретичні основи криптології
Тема: Дослідження алгоритмів визначення простоти числа
Автор: Литвиненко А.В. 525а

Опис алгоритму:
Алгоритм грубої сити перевіряє простоту числа, ділячи його на всі числа від 2 до кореня з даного числа.
Якщо жоден з дільників не ділить число без залишку, число вважається простим.
"""

def is_prime(n):
    if n <= 1:
        return False
    if n <= 3:
        return True

    for i in range(2, int(n**0.5) + 1):
        if n % i == 0:
            return False
    return True

# Приклад використання функції:
number = 17
if is_prime(number):
    print(f"{number} є простим числом")
else:
    print(f"{number} не є простим числом")
